//시작시 선언

//초성
_han[0, 0] = "r"//ㄱ
_han[0, 1] = "R"//ㄲ
_han[0, 2] = "s"//ㄴ
_han[0, 3] = "e"//ㄷ
_han[0, 4] = "E"//ㄸ
_han[0, 5] = "f"//ㄹ
_han[0, 6] = "a"//ㅁ
_han[0, 7] = "q"//ㅂ
_han[0, 8] = "Q"//ㅃ
_han[0, 9] = "t"//ㅅ
_han[0, 10] = "T"//ㅆ
_han[0, 11] = "d"//ㅇ
_han[0, 12] = "w"//ㅈ
_han[0, 13] = "W"//ㅉ
_han[0, 14] = "c"//ㅊ
_han[0, 15] = "z"//ㅋ
_han[0, 16] = "x"//ㅌ
_han[0, 17] = "v"//ㅍ
_han[0, 18] = "g"//ㅎ
//중성
_han[1, 0] = "k"//ㅏ
_han[1, 1] = "o"//ㅐ
_han[1, 2] = "i"//ㅑ
_han[1, 3] = "O"//ㅒ
_han[1, 4] = "j"//ㅓ
_han[1, 5] = "p"//ㅔ
_han[1, 6] = "u"//ㅕ
_han[1, 7] = "P"//ㅖ
_han[1, 8] = "h"//ㅗ
_han[1, 9] = "hk"//ㅘ
_han[1, 10] = "ho"//ㅙ
_han[1, 11] = "hl"//ㅚ
_han[1, 12] = "y"//ㅛ
_han[1, 13] = "n"//ㅜ
_han[1, 14] = "nj"//ㅝ
_han[1, 15] = "np"//ㅞ
_han[1, 16] = "nl"//ㅟ
_han[1, 17] = "b"//ㅠ
_han[1, 18] = "m"//ㅡ
_han[1, 19] = "ml"//ㅢ
_han[1, 20] = "l"//ㅣ

//종성
_han[2, 0] = "r"//ㄱ
_han[2, 1] = "R"//ㄲ
_han[2, 2] = "rt"//ㄳ
_han[2, 3] = "s"//ㄴ
_han[2, 4] = "sw"//ㄵ
_han[2, 5] = "sg"//ㄶ
_han[2, 6] = "e"//ㄷ
_han[2, 7] = "f"//ㄹ
_han[2, 8] = "fr"//ㄺ
_han[2, 9] = "fa"//ㄻ
_han[2, 10] = "fq"//ㄼ
_han[2, 11] = "ft"//ㄽ
_han[2, 12] = "fx"//ㄾ
_han[2, 13] = "fv"//ㄿ
_han[2, 14] = "fg"//ㅀ
_han[2, 15] = "a"//ㅁ
_han[2, 16] = "q"//ㅂ
_han[2, 17] = "qt"//ㅄ
_han[2, 18] = "t"//ㅅ
_han[2, 19] = "T"//ㅆ
_han[2, 20] = "d"//ㅇ
_han[2, 21] = "w"//ㅈ
_han[2, 22] = "c"//ㅊ
_han[2, 23] = "z"//ㅋ
_han[2, 24] = "x"//ㅌ
_han[2, 25] = "v"//ㅍ
_han[2, 26] = "g"//ㅎ

//Shift키를 사용하지 않는 글자
_nohan[0] = "Y";
_nohan[1] = "U";
_nohan[2] = "I";
_nohan[3] = "A";
_nohan[4] = "S";
_nohan[5] = "D";
_nohan[6] = "F";
_nohan[7] = "G";
_nohan[8] = "H";
_nohan[9] = "J";
_nohan[10] = "K";
_nohan[11] = "L";
_nohan[12] = "Z";
_nohan[13] = "X";
_nohan[14] = "C";
_nohan[15] = "V";
_nohan[16] = "B";
_nohan[17] = "N";
_nohan[18] = "M";


kor_keyHan = vk_control;    // 한/영키로 사용할 키 코드
kor_bul = "2";              // 한글 입력 전용, 두벌식/세벌식과 같은 자판 배열
kor_text = "";              // 한글 변환 완료된 텍스트

// 조합 리스트
tree_c = 0;                 // 조합 리스트의 개수
tree[0, 0] = 0;             // 종류
tree[0, 1] = 0;         // 인덱스



///////////////////


//초성
_gul[0, 0] = "ㄱ"
_gul[0, 1] = "ㄲ"
_gul[0, 2] = "ㄴ"
_gul[0, 3] = "ㄷ"
_gul[0, 4] = "ㄸ"
_gul[0, 5] = "ㄹ"
_gul[0, 6] = "ㅁ"
_gul[0, 7] = "ㅂ"
_gul[0, 8] = "ㅃ"
_gul[0, 9] = "ㅅ"
_gul[0, 10] = "ㅆ"
_gul[0, 11] = "ㅇ"
_gul[0, 12] = "ㅈ"
_gul[0, 13] = "ㅉ"
_gul[0, 14] = "ㅊ"
_gul[0, 15] = "ㅋ"
_gul[0, 16] = "ㅌ"
_gul[0, 17] = "ㅍ"
_gul[0, 18] = "ㅎ"
//중성
_gul[1, 0] = "ㅏ"
_gul[1, 1] = "ㅐ"
_gul[1, 2] = "ㅑ"
_gul[1, 3] = "ㅒ"
_gul[1, 4] = "ㅓ"
_gul[1, 5] = "ㅔ"
_gul[1, 6] = "ㅕ"
_gul[1, 7] = "ㅖ"
_gul[1, 8] = "ㅗ"
_gul[1, 9] = "ㅘ"
_gul[1, 10] = "ㅙ"
_gul[1, 11] = "ㅚ"
_gul[1, 12] = "ㅛ"
_gul[1, 13] = "ㅜ"
_gul[1, 14] = "ㅝ"
_gul[1, 15] = "ㅞ"
_gul[1, 16] = "ㅟ"
_gul[1, 17] = "ㅠ"
_gul[1, 18] = "ㅡ"
_gul[1, 19] = "ㅢ"
_gul[1, 20] = "ㅣ"

//종성
_gul[2, 0] = "ㄱ"
_gul[2, 1] = "ㄲ"
_gul[2, 2] = "ㄳ"
_gul[2, 3] = "ㄴ"
_gul[2, 4] = "ㄵ"
_gul[2, 5] = "ㄶ"
_gul[2, 6] = "ㄷ"
_gul[2, 7] = "ㄹ"
_gul[2, 8] = "ㄺ"
_gul[2, 9] = "ㄻ"
_gul[2, 10] = "ㄼ"
_gul[2, 11] = "ㄽ"
_gul[2, 12] = "ㄾ"
_gul[2, 13] = "ㄿ"
_gul[2, 14] = "ㅀ"
_gul[2, 15] = "ㅁ"
_gul[2, 16] = "ㅂ"
_gul[2, 17] = "ㅄ"
_gul[2, 18] = "ㅅ"
_gul[2, 19] = "ㅆ"
_gul[2, 20] = "ㅇ"
_gul[2, 21] = "ㅈ"
_gul[2, 22] = "ㅊ"
_gul[2, 23] = "ㅋ"
_gul[2, 24] = "ㅌ"
_gul[2, 25] = "ㅍ"
_gul[2, 26] = "ㅎ"



